Table of Contents
 Class IdeaPlate
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaPlate : AbstractIdeaObject<IIdeaPlate>, IEquatable<AbstractIdeaObject<IIdeaPlate>>, IIdeaPlate, IIdeaObjectConnectable, IIdeaPersistentObject, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaPlate>
IdeaPlate
Implements
IEquatable<AbstractIdeaObject<IIdeaPlate>>
IIdeaPlate
IIdeaObjectConnectable
IIdeaPersistentObject
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaPlate>.Id
 AbstractIdeaObject<IIdeaPlate>.Name
 AbstractIdeaObject<IIdeaPlate>.Identifier
 AbstractIdeaObject<IIdeaPlate>.GetHashCode()
 AbstractIdeaObject<IIdeaPlate>.Equals(object)
 AbstractIdeaObject<IIdeaPlate>.Equals(AbstractIdeaObject<IIdeaPlate>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaPlate(Identifier<IIdeaPlate>)
protected IdeaPlate(Identifier<IIdeaPlate> identifer)
Parameters
identifer Identifier<IIdeaPlate>
 IdeaPlate(int)
public IdeaPlate(int id)
Parameters
id int
 IdeaPlate(string)
public IdeaPlate(string id)
Parameters
id string
Properties
 Geometry
Geometry of the component.
public Region2D Geometry { get; set; }
Property Value
Region2D
 LocalCoordinateSystem
Local Coordinate System (LCS) of the plate. Only vector definition of the LCS is supported, so the instance of CoordSystemByVector must be returned. LCS only effects rotation of the segment, it does not modify on nodes' position.
public CoordSystem LocalCoordinateSystem { get; set; }
Property Value
CoordSystem
 Material
Material of the plate.
public virtual IIdeaMaterial Material { get; set; }
Property Value
IIdeaMaterial
 Origin
Origin node of the plate.
public virtual IIdeaNode Origin { get; set; }
Property Value
IIdeaNode
 Thickness
public double Thickness { get; set; }
Property Value
double
 Token
Persistence token. Holds data neccessery to recreated the object in future.
public virtual IIdeaPersistenceToken Token { get; set; }
Property Value
IIdeaPersistenceToken
 Edit this page